In [1]:
import pandas as pd
print(pd.__version__)

2.2.3

In [2]:
import pandas as pd
df=pd.read_csv("employees.csv")
print(df)

   id  name  salary
0   1  Riya   50000
1   2  Amit   60000

In [2]:
import pandas as pd
df=pd.read_csv("employees.csv")
df

   id  name  salary
0   1  Riya   50000
1   2  Amit   60000

In [4]:
df.head()      # first 5 rows
df.tail()      # last 5 rows
df.info()      # schema + nulls
df.describe()  # statistics (numeric columns)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      2 non-null      int64
 1   name    2 non-null      object
 2   salary  2 non-null      int64
dtypes: int64(2), object(1)
memory usage: 180.0+ bytes

             id        salary
count  2.000000      2.000000
mean   1.500000  55000.000000
std    0.707107   7071.067812
min    1.000000  50000.000000
25%    1.250000  52500.000000
50%    1.500000  55000.000000
75%    1.750000  57500.000000
max    2.000000  60000.000000

In [5]:
df.head()

   id  name  salary
0   1  Riya   50000
1   2  Amit   60000

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      2 non-null      int64
 1   name    2 non-null      object
 2   salary  2 non-null      int64
dtypes: int64(2), object(1)
memory usage: 180.0+ bytes

In [4]:
df.describe()

             id        salary
count  2.000000      2.000000
mean   1.500000  55000.000000
std    0.707107   7071.067812
min    1.000000  50000.000000
25%    1.250000  52500.000000
50%    1.500000  55000.000000
75%    1.750000  57500.000000
max    2.000000  60000.000000

In [3]:
df["Department"]=["Data","IT"]
df["Experience"]=[3,5]
df["Location"]=["Chennai","Pune"]

In [4]:
df

   id  name  salary Department  Experience Location
0   1  Riya   50000       Data           3  Chennai
1   2  Amit   60000         IT           5     Pune

In [5]:
df.loc[len(df)]=[3,"Sneha",55000,"HR",2,"Pune"]

In [6]:
df

   id   name  salary Department  Experience Location
0   1   Riya   50000       Data           3  Chennai
1   2   Amit   60000         IT           5     Pune
2   3  Sneha   55000         HR           2     Pune

In [7]:
len(df)

3

In [8]:
df.loc[len(df)]=[4,"Kiara",70000,"HR",5,"Delhi"]

In [9]:
df.to_csv("employees.csv",index=False)

In [11]:
df.groupby("Department")["salary"].mean()

Department
Data    50000.0
HR      62500.0
IT      60000.0
Name: salary, dtype: float64

In [12]:
df

   id   name  salary Department  Experience Location
0   1   Riya   50000       Data           3  Chennai
1   2   Amit   60000         IT           5     Pune
2   3  Sneha   55000         HR           2     Pune
3   4  Kiara   70000         HR           5    Delhi

In [13]:
df.loc[len(df)]=[5,"Meena",73000,"CS",6,"Nagpur"]

In [14]:
df.loc[len(df)]=[6,"Juhi",80000,"Data",6,"Delhi"]

In [15]:
df

   id   name  salary Department  Experience Location
0   1   Riya   50000       Data           3  Chennai
1   2   Amit   60000         IT           5     Pune
2   3  Sneha   55000         HR           2     Pune
3   4  Kiara   70000         HR           5    Delhi
4   5  Meena   73000         CS           6   Nagpur
5   6   Juhi   80000       Data           6    Delhi

In [8]:
import pandas as pd
df=pd.read_csv("employees.csv")
df["salary"]=df["salary"].astype(int)

In [12]:
def exp_level(exp):
    if exp<2:
        return "Junior"
    elif exp<=5 :
        return "Mid"
    else:
        return "Senior"

df["Experience_level"]=df["Experience"].apply(exp_level)

In [13]:
df

   id   name  salary Department  Experience Location Experience_level
0   1   Riya   50000       Data           3  CHENNAI              Mid
1   2   Amit   60000         IT           5     PUNE              Mid
2   3  Sneha   55000         HR           2     PUNE              Mid
3   4  Kiara   85000         HR           5    DELHI              Mid
4   5  Meena   73000         CS           6   NAGPUR           Senior
5   6   Juhi   80000       Data           6    DELHI           Senior

In [14]:
df["salary_lakhs"]=df["salary"]/100000

In [15]:
df

,id,name,salary,Department,Experience,Location,Experience_level,salary_lakhs
0,1,Riya,50000,Data,3,CHENNAI,Mid,0.50
1,2,Amit,60000,IT,5,PUNE,Mid,0.60
2,3,Sneha,55000,HR,2,PUNE,Mid,0.55
3,4,Kiara,85000,HR,5,DELHI,Mid,0.85
4,5,Meena,73000,CS,6,NAGPUR,Senior,0.73
5,6,Juhi,80000,Data,6,DELHI,Senior,0.80

In [16]:
df.head()

   id   name  salary Department  Experience Location
0   1   Riya   50000       Data           3  Chennai
1   2   Amit   60000         IT           5     Pune
2   3  Sneha   55000         HR           2     Pune
3   4  Kiara   70000         HR           5    Delhi
4   5  Meena   73000         CS           6   Nagpur

In [17]:
df.columns

Index(['id', 'name', 'salary', 'Department', 'Experience', 'Location'], dtype='object')

In [18]:
df.index

Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [19]:
df["Location"]

0    Chennai
1       Pune
2       Pune
3      Delhi
4     Nagpur
5      Delhi
Name: Location, dtype: object

In [21]:
set(df["Location"])

{'Chennai', 'Delhi', 'Nagpur', 'Pune'}

In [22]:
df.iloc[0]

id                  1
name             Riya
salary          50000
Department       Data
Experience          3
Location      Chennai
Name: 0, dtype: object

In [28]:
df.iloc[1,5]

'Pune'

In [30]:
df.iloc[1]["Location"]

'Pune'

In [31]:
df[df["Department"]=="HR"]

   id   name  salary Department  Experience Location
2   3  Sneha   55000         HR           2     Pune
3   4  Kiara   70000         HR           5    Delhi

In [33]:
df[(df["Department"]=="HR") & (df["Location"]=="Delhi")]

   id   name  salary Department  Experience Location
3   4  Kiara   70000         HR           5    Delhi

In [34]:
df[(df["Department"]=="HR") | (df["Location"]=="Delhi")]

   id   name  salary Department  Experience Location
2   3  Sneha   55000         HR           2     Pune
3   4  Kiara   70000         HR           5    Delhi
5   6   Juhi   80000       Data           6    Delhi

In [35]:
df[df["name"].str.startswith("J")]

   id  name  salary Department  Experience Location
5   6  Juhi   80000       Data           6    Delhi

In [37]:
df[df["Location"].isin(["Pune","Nagpur"])]

   id   name  salary Department  Experience Location
1   2   Amit   60000         IT           5     Pune
2   3  Sneha   55000         HR           2     Pune
4   5  Meena   73000         CS           6   Nagpur

In [38]:
df[~df["Location"].isin(["Pune","Nagpur"])]

   id   name  salary Department  Experience Location
0   1   Riya   50000       Data           3  Chennai
3   4  Kiara   70000         HR           5    Delhi
5   6   Juhi   80000       Data           6    Delhi

In [40]:
df.loc[df["name"]=="Kiara"]

   id   name  salary Department  Experience Location
3   4  Kiara   70000         HR           5    Delhi

In [41]:
df.loc[df["name"]=="Kiara","salary"]=85000

In [42]:
df.loc[df["name"]=="Kiara"]

   id   name  salary Department  Experience Location
3   4  Kiara   85000         HR           5    Delhi

In [43]:
df["Location"]=df["Location"].str.upper()

In [44]:
df

   id   name  salary Department  Experience Location
0   1   Riya   50000       Data           3  CHENNAI
1   2   Amit   60000         IT           5     PUNE
2   3  Sneha   55000         HR           2     PUNE
3   4  Kiara   85000         HR           5    DELHI
4   5  Meena   73000         CS           6   NAGPUR
5   6   Juhi   80000       Data           6    DELHI

In [23]:
df["Location"]=df["Location"].str.lower()

In [24]:
df

,id,name,salary,Department,Experience,Location,Experience_level,salary_lakhs
0,1,Riya,50000,Data,3,chennai,Mid,0.50
1,2,Amit,60000,IT,5,pune,Mid,0.60
2,3,Sneha,55000,HR,2,pune,Mid,0.55
3,4,Kiara,85000,HR,5,delhi,Mid,0.85
4,5,Meena,73000,CS,6,nagpur,Senior,0.73
5,6,Juhi,80000,Data,6,delhi,Senior,0.80

In [25]:
df.to_csv("transformed_emp.csv",index=False)

In [ ]:
transformed_emp

In [45]:
df.dropna()

   id   name  salary Department  Experience Location
0   1   Riya   50000       Data           3  CHENNAI
1   2   Amit   60000         IT           5     PUNE
2   3  Sneha   55000         HR           2     PUNE
3   4  Kiara   85000         HR           5    DELHI
4   5  Meena   73000         CS           6   NAGPUR
5   6   Juhi   80000       Data           6    DELHI

In [46]:
df["Location"].value_counts()

Location
PUNE       2
DELHI      2
CHENNAI    1
NAGPUR     1
Name: count, dtype: int64

In [47]:
df.sort_values("salary",ascending=False)

   id   name  salary Department  Experience Location
3   4  Kiara   85000         HR           5    DELHI
5   6   Juhi   80000       Data           6    DELHI
4   5  Meena   73000         CS           6   NAGPUR
1   2   Amit   60000         IT           5     PUNE
2   3  Sneha   55000         HR           2     PUNE
0   1   Riya   50000       Data           3  CHENNAI

In [16]:
high_paid=df[df["salary"]>60000]

In [17]:
high_paid

,id,name,salary,Department,Experience,Location,Experience_level,salary_lakhs
3,4,Kiara,85000,HR,5,DELHI,Mid,0.85
4,5,Meena,73000,CS,6,NAGPUR,Senior,0.73
5,6,Juhi,80000,Data,6,DELHI,Senior,0.80

In [18]:
data_team=df[df["Department"]=="HR"]

In [19]:
data_team

,id,name,salary,Department,Experience,Location,Experience_level,salary_lakhs
2,3,Sneha,55000,HR,2,PUNE,Mid,0.55
3,4,Kiara,85000,HR,5,DELHI,Mid,0.85

In [21]:
data_team.to_csv("employees_data_team.csv",index=False)